Repository: jquery/jquery-wp-content
Catalog: mu-plugins/relevanssi/relevanssi-cz_CZ.po
Languages: cs_cz

source: These words are excellent stopword material. A word that appears in most of the posts in the database is quite pointless when searching. This is also an easy way to create a completely new stopword list, if one isn't available in your language. Click the icon after the word to add the word to the stopword list. The word will also be removed from the index, so rebuilding the index is not necessary.
cs_cz: Tato slova jsou vynikající materiál pro negativní slovník. Slovo, které se objeví ve většině příspěvků, je v databázi zcela nesmyslné pro vyhledávání. Toto je také snadný způsob, jak vytvořit zcela nový negativní slovník, pokud už nějaký není k dispozici pro váš jazyk. Klikněte na ikonu za slovem a přidejte jej tak do negativního slovníku. Slovo bude také odstraněno z indexu, takže opětovné re-indexování není nutné.

source: 25 most common words in the index
cs_cz: 25 nejčastějších slov v indexu

source: <div id='message' class='updated fade'><p>Couldn't remove term '%s' from stopwords!</p></div>
cs_cz: <div id='message' class='updated fade'><p>Výraz nelze odebrat '%s' z negativního slovníku!</p></div>

source: <div id='message' class='updated fade'><p>Term '%s' removed from stopwords! Re-index to get it back to index.</p></div>
cs_cz: <div id='message' class='updated fade'><p>Výraz '%s' byl odebrán z negativního slovníku! Pro jeho vrácení do indexu je nutno re-indexovat.</p></div>

source: <div id='message' class='updated fade'><p>Stopwords removed! Remember to re-index.</p></div>
cs_cz: <div id='message' class='updated fade'><p>Stopslova byla odebrána! Nezapomeňte re-indexovat.</p></div>

source: <div id='message' class='updated fade'><p>Couldn't add term '%s' to stopwords!</p></div>
cs_cz: <div id='message' class='updated fade'><p>Výraz '%s' se nepodařilo přidat do negativního slovníku!</p></div>

source: <div id='message' class='updated fade'><p>Term '%s' added to stopwords!</p></div>
cs_cz: <div id='message' class='updated fade'><p>Výraz '%s' byl přidán do negativního slovníku!</p></div>

source: <div id='message' class='updated fade'><p>Successfully added %d/%d terms to stopwords!</p></div>
cs_cz: <div id='message' class='updated fade'><p> %d/%d výrazů bylo úspěšně přidáno do negativního slovníku!</p></div>

source: Relevanssi User Searches
cs_cz: Relevanssi - Vyhledávání návštěvníků

source: User Searches
cs_cz: Návštěvník vyhledává

source: Relevanssi Search Options
cs_cz: Relevanssi možnosti vyhledávání

source: Relevanssi Premium Search Options
cs_cz: Relevanssi možnosti vyhledávání Premium verze

source: User searches
cs_cz: Návštěvník vyhledává

source: You do not have an index! Remember to build the index (click the "Build the index" button), otherwise searching won't work.
cs_cz: Nemáte index! Nezapomeňte vytvořit index (kliknutím na tlačítko "Vytvořit index"), jinak nebude vyhledávání fungovat.

source: There is no excerpt because this is a protected post.
cs_cz: Neexistuje žádný Stručný obsah, protože se jedná o chráněný příspěvek.
