Repository: jquery/jquery-wp-content
Catalog: mu-plugins/relevanssi/relevanssi-*.po
Languages: it_it

source: There is no excerpt because this is a protected post.
it_it: Non c'è alcun estratto perché il post è protetto.

source: Indexing complete!
it_it: Indicizzazione completata!

source: Relevanssi Search Options
it_it: Opzioni per Relevanssi Search

source: <div id='message' class='update fade'><p>Term '%s' added to stopwords!</p></div>
it_it: <div id='message' class='update fade'><p>Termine '%s' aggiunto alle parole inutili ai fini della ricerca!</p></div>

source: <div id='message' class='update fade'><p>Couldn't add term '%s' to stopwords!</p></div>
it_it: <div id='message' class='update fade'><p>Non posso aggiungere il termine '%s' alle parole inutili ai fini della ricerca!</p></div>

source: 25 most common words in the index
it_it: Le 25 parole più comuni nell'indice

source: These words are excellent stopword material. A word that appears in most of the posts in the database is quite pointless when searching. This is also an easy way to create a completely new stopword list, if one isn't available in your language. Click the icon after the word to add the word to the stopword list. The word will also be removed from the index, so rebuilding the index is not necessary.
it_it: Queste parole possono dimostrarsi inutili ai fini della ricerca. Una parola che compare nella maggior parte dei posti nel database è piuttosto inutile ai fini di una buona ricerca. Questo è anche un modo semplice per creare un nuovo elenco di parole non significative, se non è disponibile nella tua lingua. Fare clic sull'icona dopo la parola per aggiungere la parola alla lista delle parole non significative. La parola sarà rimossa dall'indice e non sarà necessario ricostruire l'indice se si effettua una modifica.

source: Add to stopwords
it_it: Aggiungi alle parole inutili ai fini della ricerca

source: 25 most popular queries
it_it: 25 ricerche più effettuate

source: Recent queries that got 0 hits
it_it: Recenti ricerche che non hanno dato risultati

source: Title boost:
it_it: Potenziamento dal titolo:

source: Default: %d. 0 means titles are ignored, 1 means no boost, more than 1 gives extra value.
it_it: Predefinito %d. 0 significa che i titoli sono ignorati, 1 significa non aumentare, mentre più di 1 da un valore in più.

source: Tag boost:
it_it: Potenziamento da TAG

source: Default: %d. 0 means tags are ignored, 1 means no boost, more than 1 gives extra value.
it_it: Predefinito %d. 0 significa che i tag sono ignorati, 1 significa non aumentare, mentre più di 1 da un valore in più.

source: Comment boost:
it_it: Potenziamento dai commenti:

source: Default: %d. 0 means comments are ignored, 1 means no boost, more than 1 gives extra value.
it_it: Predefinito %d. 0 significa che i commenti sono ignorati, 1 significa non aumentare, mentre più di 1 da un valore in più.

source: Use search for admin:
it_it: Usa ricerca per admin:

source: If checked, Relevanssi will be used for searches in the admin interface
it_it: Se selezionato, Relevanssi sarà usato anche per le ricerche nell'interfaccia di amministrazione

source: Restrict search to these categories and tags:
it_it: Circoscrivi la ricerca a queste categorie e tag:

source: Enter a comma-separated list of category and tag IDs to restrict search to those categories or tags. You can also use <code>&lt;input type='hidden' name='cat' value='list of cats and tags' /&gt;</code> in your search form. The input field will overrun this setting.
it_it: Inserire un elenco separato da virgola, con gli id degli articoli e/o delle pagine a cui sarà circoscritto l'ambito di ricerca. Si può anche usare il codice <code>&lt;input type='hidden' name='cat' value='list of cats and tags' /&gt;</code> nel modulo di ricerca e quello che si inserirà nel modulo sovrascriverà quanto impostato qui.

source: Exclude these categories and tags from search:
it_it: Escludi queste categorie e tag dalla ricerca:

source: Enter a comma-separated list of category and tag IDs that are excluded from search results. This only works here, you can't use the input field option (WordPress doesn't pass custom parameters there).
it_it: Inserire un elenco separato da virgola, con gli id delle categorie e dei tag esclusi dai risultati della ricerca. Non è possibile sovrascrivere o cambiare questa impostazione inserendo dell'apposito codice nel modulo di ricerca.

source: Exclude these posts/pages from search:
it_it: Escludi questi articoli/pagine dalla ricerca:

source: Enter a comma-separated list of post/page IDs that are excluded from search results. This only works here, you can't use the input field option (WordPress doesn't pass custom parameters there).
it_it: Inserire un elenco separato da virgola, con gli id degli articoli e/o delle pagine esclusi dai risultati della ricerca. Non è possibile sovrascrivere o cambiare questa impostazione inserendo dell'apposito codice nel modulo di ricerca.

source: Index and search your posts' tags:
it_it: Indicizza e cerca i tag degli articoli:

source: If checked, Relevanssi will also index and search the tags of your posts. Remember to rebuild the index if you change this option!
it_it: Se selezionato, Relevanssi indicizzerà anche i tag degli articoli. Ricordati di ricostruire l'indice se cambi questa opzione!

source: Index and search these comments:
it_it: Indicizza e ricerca questi commenti:

source: Relevanssi will index and search ALL (all comments including track- &amp; pingbacks and custom comment types), NONE (no comments) or NORMAL (manually posted comments on your blog).<br />Remember to rebuild the index if you change this option!
it_it: Relevanssi consente di indicizzare e di effettuare le ricerche su TUTTO (compresi tutti i commenti, track & pingbacks e i commenti personalizzati), NESSUNO (commenti esclusi) o NORMALE (solo i commenti inseriti manualmente nel tuo blog). <br /> Ricordati di ricostruire l'indice, se modifichi questa opzione!

source: all
it_it: tutto

source: normal
it_it: normale

source: none
it_it: nessuno

source: Create custom search result snippets:
it_it: Crea un frammento di ricerca personalizzato:

source: If checked, Relevanssi will create excerpts that contain the search term hits. To make them work, make sure your search result template uses the_excerpt() to display post excerpts.
it_it: Se selezionato, Relevanssi creerà un estratto che conterrà la parola cercata. Affinché funzioni, assicurarsi che il template utilizzi la funzione the_excerpt() per visualizzare il risultato della ricerca.

source: Length of the snippet:
it_it: Lunghezza del frammento:

source: This must be an integer.
it_it: Deve essere un numero intero.

source: words
it_it: parole

source: characters
it_it: caratteri

source: Keep a log of user queries:
it_it: Conserva un log delle ricerche:

source: If checked, Relevanssi will log user queries.
it_it: Se selezionato, Relevanssi terrà traccia delle ricerche effettuate.

source: Highlight query terms in search results:
it_it: Evidenzia i termini di ricerca nei risultati:

source: Highlighting isn't available unless you use custom snippets
it_it: L'evidenziazione non è disponibile se non si utilizzano degli snippet personalizzati

source: Highlight query terms in result titles too:
it_it: Evidenzia i termini di ricerca anche nei titoli dei risultati:

source: Save
it_it: Salva

source: Building the index and indexing options
it_it: Costruisci l'indice e salva le opzioni di indicizzazione

source: After installing the plugin, you need to build the index. This generally needs to be done once, you don't have to re-index unless something goes wrong. Indexing is a heavy task and might take more time than your servers allow. If the indexing cannot be finished - for example you get a blank screen or something like that after indexing - you can continue indexing from where you left by clicking 'Continue indexing'. Clicking 'Build the index' will delete the old index, so you can't use that.
it_it: Dopo aver installato il plugin, è necessario costruire l'indice. Questo genere deve essere fatto una volta solo e non si deve reindicizzare fino a che qualcosa non funziona bene. L'indicizzazione è un compito pesante e potrebbe richiedere più tempo di quanto i server consentono. Se l'indicizzazione non viene completata e si ottine ad esempio una pagina bianca o qualcosa del genere, è possibile continuare l'indicizzazione dal punto in cui è stata interrotta semplicemente premendo il tasto 'Continua indicizzazione'. Cliccando invece su 'costruisci l'indice' si reinizierà da zero la creazione dell'indicie.

source: So, if you build the index and don't get the 'Indexing complete' in the end, keep on clicking the 'Continue indexing' button until you do. On my blogs, I was able to index ~400 pages on one go, but had to continue indexing twice to index ~950 pages.
it_it: Se si crea l'indice e alla fine non si ottiene il risultato di 'indicizzazione completa', cliccare nuovamente sul pulsante 'Continua indicizzazione' fino a quando non si otterrà tale risultato. Il mo blog ad esempio è stato in grado di indicizzare circa 400 pagine in una volta sola, ma ha dovuto continuare l'indicizzazione due volte per completare l'indice di circa 950 pagine.

source: Save indexing options and build the index
it_it: Salva le opzioni di indicizzazione e costruisci l'indice

source: Continue indexing
it_it: Continua indicizzazione

source: No highlighting
it_it: No evidenziazione

source: Text color
it_it: Colore del testo

source: Background color
it_it: Colore di sfondo

source: CSS Style
it_it: Stile CSS

source: CSS Class
it_it: Classe CSS

source: Text color for highlights:
it_it: Colore del testo delle evidenziazioni:

source: Background color for highlights:
it_it: Colore di sfondo delle evidenziazioni:

source: CSS style for highlights:
it_it: Stile CSS per le evidenziazioni:

source: CSS class for highlights:
it_it: Classe CSS per le evidenziazioni:

source: Use HTML color codes (#rgb or #rrggbb)
it_it: Usare il codice colore HTML (#rgb o #rrggbb)

source: You can use any CSS styling here, style will be inserted with a &lt;span&gt;
it_it: È possibile usare qualsiasi stile CSS, lo stile sarà inserito con &lt;span&gt;

source: Name a class here, search results will be wrapped in a &lt;span&gt; with the class
it_it: Nome della classe qui. I risultati di ricerca saranno compresi in &lt;span&gt; con la classe

source: What to include in the index
it_it: Cosa includere nell'indice

source: Everything
it_it: Ogni cosa

source: Just posts
it_it: Solo articoli

source: Just pages
it_it: Solo pagine

source: Custom fields to index:
it_it: Campi personalizzati da indicizzare:

source: A comma-separated list of custom field names to include in the index.
it_it: Una lista separata da virgola dei nomi personalizzati da includere nell'indice.

source: Show breakdown of search hits in excerpts:
it_it: Viusalizza un separatore nei risultati di ricerca:

source: Check this to show more information on where the search hits were made. Requires custom snippets to work.
it_it: Seleziona qui per mostrare più informazioni o per definire dove sarà effettuata la ricerca. Per attivarlo richiede uno snippet personalizzato.

source: The breakdown format:
it_it: Formato dell'interruzione:

source: Use %body%, %title%, %tags%, %comments% and %score% to display the number of hits and the document weight.
it_it: Usa %body%, %title%, %tags%, %comments% e %score% per visualizzare il numero di ricorrenze e il peso del documento.

source: When to use fuzzy matching?
it_it: Quando usare la ricerca per parola simile?

source: When straight search gets no hits
it_it: Quando la ricerca regolare non produce risultati

source: Always
it_it: Sempre

source: Don't use fuzzy search
it_it: Non usare la ricerca per similitudini

source: Straight search matches just the term. Fuzzy search matches everything that begins or ends with the search term.
it_it: La ricerca regolare cerca semplicemente un termine. La ricerca per similitudine trova anche tutti i termini che iniziano o finiscono come il termine di ricerca.
