Repository: jquery/jquery-wp-content
Catalog: mu-plugins/relevanssi/relevanssi-cz_CZ.po
Languages: cs_cz

source: This plugin replaces WordPress search with a relevance-sorting search.
cs_cz: Tento plugin nahrazuje WordPress hledání s vyhledáváním a tříděním podle relevance.

source: Category weight:
cs_cz: Váha kategorie:

source: Tag weight:
cs_cz: Váha tagu:

source: Data wiped clean, you can now delete the plugin.
cs_cz: Data vyčištěna dočista, plugin nyní můžete smazat.

source: Here's a list of stopwords you can use to export the stopwords to another blog.
cs_cz: Zde je seznam stopslov, který může být použít k exportu do jiného blogu.

source: Remove all stopwords
cs_cz: Odstranit všechna stopslova

source: <p>Here's a list of stopwords in the database. Click a word to remove it from stopwords. Removing stopwords won't automatically return them to index, so you need to re-index all posts after removing stopwords to get those words back to index.
cs_cz: <p>Zde je seznam stopslov v databázi. Kliknutím na slovo jej ze zakázaných odeberete. Po odebrání stopslov se tato automaticky nevrací do indexu, takže po odebrání stopslov je třeba re-indexovat všechny příspěvky, aby se tato slova dostala zpět do indexu.

source: Add
cs_cz: Přidat

source: Stopword(s) to add:
cs_cz: Stopslova k přidání:

source: <p>Enter a word here to add it to the list of stopwords. The word will automatically be removed from the index, so re-indexing is not necessary. You can enter many words at the same time, separate words with commas.</p>
cs_cz: <p>Sem zadejte slovo, které chcete přidat do negativního slovníku. Slovo bude automaticky odstraněno z indexu a re-indexování nebude nutné. Můžete zadat více slov najednou, jednotlivá slova oddělujte čárkami.</p>

source: Add synonyms here in 'key = value' format. When searching with the OR operator, any search of 'key' will be expanded to include 'value' as well. Using phrases is possible. The key-value pairs work in one direction only, but you can of course repeat the same pair reversed.
cs_cz: Zde přidejte synonyma formou 'klíč = hodnota". Při vyhledávání s operátorem OR, budou všechna hledání "klíče" rozšířena také o "hodnotu". Také použití frází je možné. Dvojice klíč-hodnota fungují pouze v jednom směru, ale můžete samozřejmě uvést stejný pár opačně.

source: Save indexing options, erase index and rebuild the index
cs_cz: Uložit nastavení indexování, smazat index a znovu vytvořit index

source: A comma-separated list of custom fields to include in the index. Set to 'visible' to index all visible custom fields and to 'all' to index all custom fields, also those starting with a '_' character.
cs_cz: Seznam vlastních polí oddělený čárkami, které budou zahrnuty do indexu. Pro indexování všech viditelných vlastních polí nastavte na "visible" anebo "vše" pro indexaci všech vlastních polí, tedy i těch, které začínající znakem "_".

source: Custom fields to index:
cs_cz: Vlastní pole k indexování:

source: Relevanssi will index and search ALL (all comments including track- &amp; pingbacks and custom comment types), NONE (no comments) or NORMAL (manually posted comments on your blog).<br />Remember to rebuild the index if you change this option!
cs_cz: Relevanssi bude indexovat a prohledávat VŠE (všechny komentáře včetně track- &amp; pingbacks a vlastní typy komentářů), NIC (žádné komentáře) nebo NORMÁLNÍ (ručně odeslané komentáře).<br />Nezapomeňte znovu vytvořit index, pokud tuto možnost změníte!

source: all
cs_cz: vše

source: normal
cs_cz: normální

source: none
cs_cz: nic

source: Index and search these comments:
cs_cz: Indexovat a vyhledávat tyto komentáře:

source: If checked, Relevanssi will also index and search the excerpts of your posts.Remember to rebuild the index if you change this option!
cs_cz: Je-li zaškrtnuto, Relevanssi bude indexovat a hledat také Stručný obsah vašich příspěvků. Nezapomeňte znovu vytvořit index, pokud tuto možnost změníte!

source: Index and search post excerpts:
cs_cz: Indexovat a hledat Stručný obsah příspěvků:

source: If checked, Relevanssi will also index and search the authors of your posts. Author display name will be indexed. Remember to rebuild the index if you change this option!
cs_cz: Je-li zaškrtnuto, Relevanssi bude indexovat a hledat také autory vašich příspěvků. Zobrazované jméno autora bude indexováno. Nezapomeňte znovu vytvořit index, pokud tuto možnost změníte!

source: Index and search your posts' authors:
cs_cz: Indexovat a hledat vaše příspěvky autorů:

source: If checked, Relevanssi will expand shortcodes in post content before indexing. Otherwise shortcodes will be stripped. If you use shortcodes to include dynamic content, Relevanssi will not keep the index updated, the index will reflect the status of the shortcode content at the moment of indexing.
cs_cz: Je-li zaškrtnuto, Relevanssi bude před indexováním vykonávat zkrácené kódy v obsahu příspěvků. Jinak by byly vynechány. Pokud používáte zkrácené kódy ke zobrazení dynamického obsahu, Relevanssi nebude udržovat index aktualizovaný, index bude odrážet pouze stav obsahu zkráceného kódu v okamžiku indexování.

source: Expand shortcodes in post content:
cs_cz: Vykonávat zkrácené kódy v obsahu příspěvku:

source: Words shorter than this number will not be indexed.
cs_cz: Slova kratší než tento počet nebudou indexována.

source: Minimum word length to index
cs_cz: Minimální délka slova k indexování

source: If you check a taxonomy here, the terms for that taxonomy are indexed with the posts. If you for example choose "post_tag", searching for tags will find all posts that have the tag.
cs_cz: Pokud zde zaškrtnete taxonomii, výrazy pro tuto taxonomii jsou indexovány spolu s příspěvky. Pokud například zvolíte "post_tag" hledal tagů najdete všechny příspěvky, které mají takový tag.

source: Taxonomy
cs_cz: Taxonomie

source: Choose taxonomies to index:
cs_cz: Vyberte taxonomii k indexování:

source: no
cs_cz: ne

source: yes
cs_cz: ano

source: Public?
cs_cz: Veřejné?

source: Type
cs_cz: Typ

source: Choose post types to index:
cs_cz: Vyberte typy příspěvků k indexování:

source: Save the options
cs_cz: Uložit nastavení

source: Name a class here, search results will be wrapped in a &lt;span&gt; with the class
cs_cz: Uveďte třídu zde, výsledky vyhledávání budou zabaleny v &lt;span&gt; se třídou

source: CSS class for highlights:
cs_cz: CSS třída pro zvýraznění

source: You can use any CSS styling here, style will be inserted with a &lt;span&gt;
cs_cz: Zde můžete použít jakýkoli CSS styl , styl bude vložen pomocí &lt;span&gt;

source: CSS style for highlights:
cs_cz: CSS styl pro zvýraznění

source: Background color for highlights:
cs_cz: Barva pozadí pro zvýraznění

source: Use HTML color codes (#rgb or #rrggbb)
cs_cz: Použijte HTML kódy barev (#rgb či #rrggbb)

source: Text color for highlights:
cs_cz: Barva textu pro zvýraznění

source: Then adjust the settings for your chosen type:
cs_cz: Poté upravte nastavení pro zvolený typ:

source: If you use non-ASCII characters (like Cyrillic alphabet) and the highlights don't work, uncheck this option to make highlights work.
cs_cz: Pokud používáte jiné znaky než ASCII (např. azbuku) a zvýraznění nefungují, odškrtněte tuto volbu, aby zvýraznění začalo fungovat.

source: Uncheck this if you use non-ASCII characters:
cs_cz: Odškrtněte tuto možnost, pokud používáte jiné znaky než ASCII:

source: Highlights hits in comments when user opens the post from search results.
cs_cz: Zvýraznit shody v komentářích, když uživatel příspěvek otevře z výsledků vyhledávání.

source: Highlight query terms in comments:
cs_cz: Zvýraznit hledané výrazy v komentářích:

source: Highlights hits when user opens the post from search results. This is based on HTTP referrer, so if that's blocked, there'll be no highlights.
cs_cz: Zvýraznit shody, když uživatel příspěvek otevře z výsledků vyhledávání. To je založeno na HTTP referreru, takže pokud bude blokován, nic nebude zvýrazněno.

source: Highlight query terms in documents from local searches:
cs_cz: Zvýraznit hledané výrazy v dokumentech z místního vyhledávání:

source: Highlight query terms in result titles too:
cs_cz: Zvýraznit hledané výrazy také v názvech výsledků:

source: Highlighting isn't available unless you use custom snippets
cs_cz: Zvýraznění není k dispozici, pokud budete používat vlastní úryvky

source: CSS Class
cs_cz: CSS Třída

source: CSS Style
cs_cz: CSS Kaskádový styl

source: Background color
cs_cz: Barva pozadí

source: Text color
cs_cz: Barva textu

source: No highlighting
cs_cz: Žádné zvýraznění

source: Highlight query terms in search results:
cs_cz: Zvýraznit hledané výrazy ve výsledcích vyhledávání:

source: First, choose the type of highlighting used:
cs_cz: Nejprve vyberte jaký typ zvýraznění používat:

source: Search hit highlighting
cs_cz: Zvýraznění nalezené shody

source: Use %body%, %title%, %tags% and %comments% to display the number of hits (in different parts of the post), %total% for total hits, %score% to display the document weight and %terms% to show how many hits each search term got. No double quotes (") allowed!
cs_cz: Použijte %body%, %title%, %tags% a %comments% pro zobrazení počtu shod (v různých částech příspěvku), %total% pro součet shod, %score% pro zobrazení váhy dokumentu a %terms% pro zobrazení kolik měl hledaný výraz shod. Nejsou povoleny žádné uvozovky (")!

source: The breakdown format:
cs_cz: Formát členění:

source: Check this to show more information on where the search hits were made. Requires custom snippets to work.
cs_cz: Zaškrtněte, pro více informací o tom, kde došlo ke shodě při vyhledávaní. Pro správnou funkci jsou vyžadovány vlastní úryvky.

source: Show breakdown of search hits in excerpts:
cs_cz: Zobrazit náhledy nalezených výsledků shod:

source: List all tags you want to allow in excerpts, without any whitespace. For example: '&lt;p&gt;&lt;a&gt;&lt;strong&gt;'.
cs_cz: Vyjmenovat všechny tagy, které chcete povolit ve Stručných obsazích, a to bez jakékoliv mezery. Například: '&lt;p&gt;&lt;a&gt;&lt;strong&gt;'.

source: Allowable tags in excerpts:
cs_cz: Přípustné tagy ve Stručných obsazích

source: This must be an integer.
cs_cz: Zde musí být číslo.

source: words
cs_cz: slov

source: characters
cs_cz: znaků

source: Length of the snippet:
cs_cz: Délka úryvku:

source: Note: Building custom excerpts can be slow. If you are not actually using the excerpts, make sure you disable the option.
cs_cz: Poznámka: Vytváření vlastních stručných seznamů může být pomalé. Pokud vlastní stručné seznamy nepoužíváte, ujistěte se, že tato volba zůstane vypnutá.

source: If checked, Relevanssi will create excerpts that contain the search term hits. To make them work, make sure your search result template uses the_excerpt() to display post excerpts.
cs_cz: Je-li zaškrtnuto, Relevanssi vytvoří náhled, který obsahuje shodu hledaného výrazu. Pro správnou funkcionalitu se ujistěte, že vaše šablona výsledků vyhledávání používá the_excerpt() pro zobrazení stručných seznamů.

source: Create custom search result snippets:
cs_cz: Vytvářet vlastní výsledky vyhledávání úryvků:

source: Custom excerpts/snippets
cs_cz: Vlastní Náhledy / úryvky

source: If checked, Relevanssi won't display posts of custom post types that have 'exclude_from_search' set to true. If not checked, Relevanssi will display anything that is indexed.
cs_cz: Je-li zaškrtnuto, Relevanssi nezobrazí příspěvky vlastních typů, které mají nastaveno "exclude_from_search" na true. Pokud není zaškrtnuto, Relevanssi zobrazí vše, co je indexováno.

source: Respect exclude_from_search for custom post types:
cs_cz: Respektovat exclude_from_search pro vlastní typy příspěvků:

source: Enter a comma-separated list of post/page IDs that are excluded from search results. This only works here, you can't use the input field option (WordPress doesn't pass custom parameters there).
cs_cz: Zadejte seznam ID příspěvků / stránek oddělených čárkami, které mají být vyloučeny z výsledků vyhledávání. Toto funguje jen zde, nemůžete použít volbu u vstupního pole (WordPress tam nepovoluje vlastní parametry).

source: Enter a comma-separated list of post/page IDs that are excluded from search results. This only works here, you can't use the input field option (WordPress doesn't pass custom parameters there). You can also use a checkbox on post/page edit pages to remove posts from index.
cs_cz: Zadejte seznam ID příspěvků / stránek oddělených čárkami, které mají být vyloučeny z výsledků vyhledávání. Toto funguje jen zde, nemůžete použít volbu u vstupního pole (WordPress tam nepovoluje vlastní parametry). Můžete také použít zaškrtávací políčko na příspěvku / stránce při editaci - odstranit příspěvek z indexu.

source: Exclude these posts/pages from search:
cs_cz: Vyloučit tyto příspěvky / stránky z vyhledávání:

source: Enter a comma-separated list of tag IDs that are excluded from search results.
cs_cz: Zadejte seznam ID tagů oddělených čárkami, které mají být vyloučeny z výsledků vyhledávání.

source: Exclude these tags from search:
cs_cz: Vyloučit tyto tagy z vyhledávání:

source: Enter a comma-separated list of category IDs that are excluded from search results.
cs_cz: Zadejte seznam ID kategorií oddělených čárkami, které mají být vyloučeny z výsledků vyhledávání.

source: Exclude these categories from search:
cs_cz: Vyloučit tyto kategorie z vyhledávání:

source: Enter a comma-separated list of category and tag IDs to restrict search to those categories or tags. You can also use <code>&lt;input type='hidden' name='cats' value='list of cats and tags' /&gt;</code> in your search form. The input field will overrun this setting.
cs_cz: Zadejte seznam kategorií a ID tagů oddělený čárkami pro omezení vyhledávání na pouze na tyto kategorie nebo tagy. Můžete také použít <code>&lt;input type='hidden' name='cats' value='list of cats and tags' /&gt;</code> ve vyhledávacím formuláři. Vstupní pole bude převáží toto nastavení.

source: Restrict search to these categories and tags:
cs_cz: Omezit vyhledávání pouze těchto kategorií a tagů:

source: If you enable logs, you can see what your users are searching for. Logs are also needed to use the 'Did you mean?' feature. You can prevent your own searches from getting in the logs with the omit feature.
cs_cz: Pokud povolíte logování, můžete vidět, co vaši uživatelé hledají. Protokoly jsou zapotřebí také pro funkci "Měli jste na mysli?". Můžete však zabránit tomu, aby vaše vlastní vyhledávání byla logována.

source: If you enable logs, you can see what your users are searching for. You can prevent your own searches from getting in the logs with the omit feature.
cs_cz: Pokud povolíte logování, můžete vidět, co vaši uživatelé hledají. Můžete však zabránit tomu, aby vaše vlastní vyhledávání byla logována.

source: Comma-separated list of numeric user IDs or user login names that will not be logged.
cs_cz: Čárkou oddělený seznam uživatelských jmen, nebo jejich číselných ID, jejichž hledání nebude logováno.

source: Don't log queries from these users:
cs_cz: Nelogovat dotazy od těchto uživatelů:

source: If checked, Relevanssi will log user's IP-Adress with the queries.
cs_cz: Je-li zaškrtnuto, Relevanssi bude spolu s u6ivatelovými dotazy logovat i jeho IP adresu.

source: Log the user's IP with the queries:
cs_cz: Spolu s dotazy logovat i uživatelovu IP:

source: If checked, Relevanssi will log user queries. The log appears in 'User searches' on the Dashboard admin menu.
cs_cz: Je-li zaškrtnuto, Relevanssi bude logovat uživatelské dotazy. Log se objeví v "Návštěvník vyhledává" v admin menu Nástěnka.

source: Keep a log of user queries:
cs_cz: Zachovat log uživatelských dotazů:

source: Limit results to current language:
cs_cz: Omezit výsledky pouze pro aktuální jazyk:

source: WPML/Polylang compatibility
cs_cz: WPML kompatibilita

source: Comment text
cs_cz: Text komentáře

source: Post titles
cs_cz: Názvy příspěvků

source: Default weight
cs_cz: Výchozí váha

source: Weight
cs_cz: Váha

source: Element
cs_cz: Prvek

source: These values affect the weights of the documents. These are all multipliers, so 1 means no change in weight, less than 1 means less weight, and more than 1 means more weight. Setting something to zero makes that worthless. For example, if title weight is more than 1, words in titles are more significant than words elsewhere. If title weight is 0, words in titles won't make any difference to the search results.
cs_cz: Tyto hodnoty ovlivňují váhu dokumentů. Všechno jsou to násobky, takže 1 znamená žádnou změnu váhy, menší než 1, znamená snížení váhy a více než 1 znamená větší váhu. Nastavení položky na nulu z ní udělá bezcennou. Například, pokud váha názvu je větší než 1, slova v názvech budou mnohem významnější než slova jinde. Pokud bude váha názvu 0, nebudou mít slova v názvech žádnou hodnotu pro výsledky vyhledávání.

source: For better performance, adjust the limit to a smaller number. Adjusting the limit to 100 or 200 should be safe for good results, and might bring a boost in search speed. DO NOT use this feature to limit the number of search results on search results pages, as that will lead to problems. For adjusting the number of search results displayed, see <a href='%s'>this knowledge base entry</a>.
cs_cz: Pro lepší výkon, nastavte limit na menší číslo. Nastavení limitu na 100 nebo 200 by mělo být bezpečné pro dobré výsledky, zároveň může přinést zvýšení rychlosti vyhledávání. NEPOUŽÍVEJTE tuto funkci pro omezení počtu výsledků na stránce výsledků vyhledávání, protože to povede k problémům. Pro nastavení počtu zobrazených výsledků vyhledávání na stránku si přečtěte <a href='%s'>článek v této znalostní bázi</a>.

source: If this option is checked, Relevanssi will limit search results to at most 500 results per term. This will improve performance, but may cause some relevant documents to go unfound. However, Relevanssi tries to prioritize the most relevant documents. <strong>This does not work well when sorting results by date.</strong> The throttle can end up cutting off recent posts to favour more relevant posts.
cs_cz: Pokud je tato volba aktivní, Relevanssi omezí výsledky vyhledávání na maximálně 500 výsledků na výraz. Tím se zlepší výkon, ale může to způsobit, že některé relevantní dokumenty nebudou nalezeny. Nicméně, Relevanssi se snaží upřednostnit nejrelevantnější dokumenty. <strong>Což úplně neplatí, pokud jsou výsledky řazeny podle data.</strong> Nastavení tak může upřednostnit nedávné příspěvkz před jinak relevantnějšími.

source: Limit searches:
cs_cz: Limit hledání

source: Straight search matches just the term. Fuzzy search matches everything that begins or ends with the search term.
cs_cz: Přímé vyhledávání najde jen přesný výraz. Přibližné vyhledávání najde vše, co začíná nebo končí hledaným výrazem.

source: Don't use fuzzy search
cs_cz: Nepoužívat přibližné vyhledávání

source: Always
cs_cz: Vždy

source: When straight search gets no hits
cs_cz: Když přímé hledání nevrátí žádný výsledek

source: When to use fuzzy matching?
cs_cz: Kdy použít přibližnou shodu?

source: If you want date-based results, see the recent post bonus in the Weights section.
cs_cz: Chcete-li výsledky na základě data vytvoření, přejděte na sekci Váhy.

source: Post date
cs_cz: Datum příspěvku

source: Relevance (highly recommended)
cs_cz: Relevance (výrazně doporučeno)

source: Default order for results:
cs_cz: Výchozí řazení výsledků

source: If you don't want Relevanssi to fall back to OR search when AND search gets no hits, check this option. For most cases, leave this one unchecked.
cs_cz: Pokud nechcete aby Relevanssi přešlo do hledání s OR, pokud hledání AND nenajde žádný výsledek, zaškrtněte tuto volbu. Ve většině případů ponechte nezaškrtnuté.

source: Disable OR fallback:
cs_cz: Zakázat automatické přepnutí na OR

source: If you choose AND and the search finds no matches, it will automatically do an OR search.
cs_cz: Zvolíte-li AND a hledání najde žádnou shodu, bude automaticky provedeno hledání s operátorem OR.

source: OR - any term present is enough
cs_cz: OR - výskyt jakéhokoli výrazu je dostatečný

source: AND - require all terms
cs_cz: AND - vyžaduje všechny výrazy

source: Default operator for the search?
cs_cz: Výchozí operátor pro vyhledávání?

source: If checked, Relevanssi will be used for searches in the admin interface
cs_cz: Je-li zaškrtnuto, bude Relevanssi použito i pro vyhledávání v administrátorském rozhraní

source: Use search for admin:
cs_cz: Použít vyhledávání pro admin:

source: Highest post ID indexed
cs_cz: Nejvyšší ID zaindexovaného příspěvku

source: Terms in the index
cs_cz: Výrazy v indexu

source: Documents in the index
cs_cz: Dokumentů v indexu

source: State of the Index
cs_cz: Stav indexu

source: Use 'Build the index' to build the index with current <a href='#indexing'>indexing options</a>. If you can't finish indexing with one go, use 'Continue indexing' to finish the job. You can change the number of documents to add until you find the largest amount you can add with one go. See 'State of the Index' below to find out how many documents actually go into the index.
cs_cz: Použijte 'Vytvořit index' k vytvoření indexu s aktuálním <a href='#indexing'>nastavením indexování</a>. Pokud nemůže dokončit indexování najednou, použijte "Pokračovat v indexování", pro dokončení úlohy. Můžete měnit počet dokumentů, které přidáváte, dokud nenajdete největší počet, který můžete zpracovat na jeden zátah. Viz "Stav Indexu" kde zjistíte, kolik dokumentů je skutečně zaindexováno.

source: WARNING: You've chosen no post types to index. Nothing will be indexed. <a href='#indexing'>Choose some post types to index</a>.
cs_cz: POZOR: Nevybrali jste žádný typ příspěvků k indexování. Nic nebude indexováno. <a href='#indexing'>Vyberte k indexování některé typy příspěvků</a>.

source: documents.
cs_cz: dokumentů.

source: add
cs_cz: přidat

source: Continue indexing
cs_cz: Pokračovat v indexování

source: Build the index
cs_cz: Vytvořit index

source: Save options
cs_cz: Uložit nastavení

source: Quick tools
cs_cz: Rychlé nástroje

source: Buy Relevanssi Premium
cs_cz: Koupit Relevanssi Premium

source: Import/export options
cs_cz: Import/export nastavení

source: Stopwords
cs_cz: Stopslova

source: Synonyms
cs_cz: Synonyma

source: Indexing options
cs_cz: Možnosti indexování

source: Highlighting search results
cs_cz: Zvýraznění výsledků hledání

source: Custom excerpts
cs_cz: Vlastní náhledy

source: Exclusions and restrictions
cs_cz: Výjimky a omezení

source: Logs
cs_cz: Logy

source: Weights
cs_cz: Váhy

source: Basic options
cs_cz: Základní nastavení

source: Hits
cs_cz: Hity

source: Query
cs_cz: Dotaz

source: Searches
cs_cz: Vyhledávání

source: When
cs_cz: Kdy

source: Forever
cs_cz: Od počátku

source: To reset the logs, type "reset" into the box here %s and click %s
cs_cz: Logy lze promazat zapsáním řetězce "reset" do tohoto pole %s a kliknutím na tlačítko %s

source: Reset Logs
cs_cz: Vymazat logy

source: Unsuccessful Queries
cs_cz: Neúspěšné vyhledávací dotazy

source: Last 30 days
cs_cz: Posledních 30 dní

source: Last 7 days
cs_cz: Posledních 7 dní

source: Today and yesterday
cs_cz: Dnes a včera

source: Here you can see the 20 most common user search queries, how many times those queries were made and how many results were found for those queries.
cs_cz: Zde můžete vidět 20 nejčastěji vyhledávaných výrazů, kolikrát byly tyto, řetězce hledány a kolik výsledků bylo u těch dotazů nalezeno.

source: Common Queries
cs_cz: Často vyhledávané dotazy

source: Totals
cs_cz: Celkem

source: Total Searches
cs_cz: Souhrn vyhledávání

source: Add to stopwords
cs_cz: Přidat do negativního slovníku
